---
kind: property
id: P:Autodesk.Revit.DB.PolymeshTopology.DistributionOfNormals
source: html/a3846cce-c6f0-683e-36f8-ea60c7f7843b.htm
---
# Autodesk.Revit.DB.PolymeshTopology.DistributionOfNormals Property

Indicates the distribution of normal vectors along the tessellated polymesh surface.

## Syntax (C#)
```csharp
public DistributionOfNormals DistributionOfNormals { get; }
```